{
	"title":"DesktopServer",
	"clickWrap":"DesktopServer - A Desktop Web Server Control Panel
Copyright 2019 by ServerPress, LLC

DesktopServer is a compilation of GNU General Public License software and other FOSS (Free Open Source Software) components. You will find additional licenses of the contained products within the 'license' subfolder of this installer. By accepting this license, you acknowledge that you are installing a compilation of GNU General Public License software and other FOSS (Free Open Source Software) components and will abide to the additional aforementioned license terms.

This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

DesktopServer is released under the GPL Version 2. 		    GNU GENERAL PUBLIC LICENSE		       Version 2, June 1991

 Copyright (C) 1989, 1991 Free Software Foundation, Inc. 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA

 Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.

			    Preamble

  The licenses for most software are designed to take away yourfreedom to share and change it.  By contrast, the GNU General PublicLicense is intended to guarantee your freedom to share and change freesoftware--to make sure the software is free for all its users.  ThisGeneral Public License applies to most of the Free SoftwareFoundation's software and to any other program whose authors commit tousing it.  (Some other Free Software Foundation software is covered bythe GNU Library General Public License instead.)  You can apply it toyour programs, too.

  When we speak of free software, we are referring to freedom, notprice.  Our General Public Licenses are designed to make sure that youhave the freedom to distribute copies of free software (and charge forthis service if you wish), that you receive source code or can get itif you want it, that you can change the software or use pieces of itin new free programs; and that you know you can do these things.

  To protect your rights, we need to make restrictions that forbidanyone to deny you these rights or to ask you to surrender the rights.These restrictions translate to certain responsibilities for you if youdistribute copies of the software, or if you modify it.

  For example, if you distribute copies of such a program, whethergratis or for a fee, you must give the recipients all the rights thatyou have.  You must make sure that they, too, receive or can get thesource code.  And you must show them these terms so they know theirrights.

  We protect your rights with two steps: (1) copyright the software, and(2) offer you this license which gives you legal permission to copy,distribute and/or modify the software.

  Also, for each author's protection and ours, we want to make certainthat everyone understands that there is no warranty for this freesoftware.  If the software is modified by someone else and passed on, wewant its recipients to know that what they have is not the original, sothat any problems introduced by others will not reflect on the originalauthors' reputations.

  Finally, any free program is threatened constantly by softwarepatents.  We wish to avoid the danger that redistributors of a freeprogram will individually obtain patent licenses, in effect making theprogram proprietary.  To prevent this, we have made it clear that anypatent must be licensed for everyone's free use or not licensed at all.

  The precise terms and conditions for copying, distribution andmodification follow.

		    GNU GENERAL PUBLIC LICENSE   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION

  0. This License applies to any program or other work which containsa notice placed by the copyright holder saying it may be distributedunder the terms of this General Public License.  The \"Program\", below,refers to any such program or work, and a \"work based on the Program\"means either the Program or any derivative work under copyright law:that is to say, a work containing the Program or a portion of it,either verbatim or with modifications and/or translated into anotherlanguage.  (Hereinafter, translation is included without limitation inthe term \"modification\".)  Each licensee is addressed as \"you\".

Activities other than copying, distribution and modification are notcovered by this License; they are outside its scope.  The act ofrunning the Program is not restricted, and the output from the Programis covered only if its contents constitute a work based on theProgram (independent of having been made by running the Program).Whether that is true depends on what the Program does.

  1. You may copy and distribute verbatim copies of the Program'ssource code as you receive it, in any medium, provided that youconspicuously and appropriately publish on each copy an appropriatecopyright notice and disclaimer of warranty; keep intact all thenotices that refer to this License and to the absence of any warranty;and give any other recipients of the Program a copy of this Licensealong with the Program.

You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.

  2. You may modify your copy or copies of the Program or any portionof it, thus forming a work based on the Program, and copy anddistribute such modifications or work under the terms of Section 1above, provided that you also meet all of these conditions:

    a) You must cause the modified files to carry prominent notices    stating that you changed the files and the date of any change.

    b) You must cause any work that you distribute or publish, that in    whole or in part contains or is derived from the Program or any    part thereof, to be licensed as a whole at no charge to all third    parties under the terms of this License.

    c) If the modified program normally reads commands interactively    when run, you must cause it, when started running for such    interactive use in the most ordinary way, to print or display an    announcement including an appropriate copyright notice and a    notice that there is no warranty (or else, saying that you provide    a warranty) and that users may redistribute the program under    these conditions, and telling the user how to view a copy of this    License.  (Exception: if the Program itself is interactive but    does not normally print such an announcement, your work based on    the Program is not required to print an announcement.)

These requirements apply to the modified work as a whole.  Ifidentifiable sections of that work are not derived from the Program,and can be reasonably considered independent and separate works inthemselves, then this License, and its terms, do not apply to thosesections when you distribute them as separate works.  But when youdistribute the same sections as part of a whole which is a work basedon the Program, the distribution of the whole must be on the terms ofthis License, whose permissions for other licensees extend to theentire whole, and thus to each and every part regardless of who wrote it.Thus, it is not the intent of this section to claim rights or contestyour rights to work written entirely by you; rather, the intent is toexercise the right to control the distribution of derivative orcollective works based on the Program.

In addition, mere aggregation of another work not based on the Programwith the Program (or with a work based on the Program) on a volume ofa storage or distribution medium does not bring the other work underthe scope of this License.

  3. You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms ofSections 1 and 2 above provided that you also do one of the following:

    a) Accompany it with the complete corresponding machine-readable    source code, which must be distributed under the terms of Sections    1 and 2 above on a medium customarily used for software interchange; or,

    b) Accompany it with a written offer, valid for at least three    years, to give any third party, for a charge no more than your    cost of physically performing source distribution, a complete    machine-readable copy of the corresponding source code, to be    distributed under the terms of Sections 1 and 2 above on a medium    customarily used for software interchange; or,

    c) Accompany it with the information you received as to the offer    to distribute corresponding source code.  (This alternative is    allowed only for noncommercial distribution and only if you    received the program in object code or executable form with such    an offer, in accord with Subsection b above.)

The source code for a work means the preferred form of the work formaking modifications to it.  For an executable work, complete sourcecode means all the source code for all modules it contains, plus anyassociated interface definition files, plus the scripts used tocontrol compilation and installation of the executable.  However, as aspecial exception, the source code distributed need not includeanything that is normally distributed (in either source or binaryform) with the major components (compiler, kernel, and so on) of theoperating system on which the executable runs, unless that componentitself accompanies the executable.

If distribution of executable or object code is made by offeringaccess to copy from a designated place, then offering equivalentaccess to copy the source code from the same place counts asdistribution of the source code, even though third parties are notcompelled to copy the source along with the object code.

  4. You may not copy, modify, sublicense, or distribute the Programexcept as expressly provided under this License.  Any attemptotherwise to copy, modify, sublicense or distribute the Program isvoid, and will automatically terminate your rights under this License.However, parties who have received copies, or rights, from you underthis License will not have their licenses terminated so long as suchparties remain in full compliance.

  5. You are not required to accept this License, since you have notsigned it.  However, nothing else grants you permission to modify ordistribute the Program or its derivative works.  These actions are prohibited by law if you do not accept this License.  Therefore, bymodifying or distributing the Program (or any work based on theProgram), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifyingthe Program or works based on it.

  6. Each time you redistribute the Program (or any work based on theProgram), the recipient automatically receives a license from theoriginal licensor to copy, distribute or modify the Program subject tothese terms and conditions.  You may not impose any furtherrestrictions on the recipients' exercise of the rights granted herein.You are not responsible for enforcing compliance by third parties tothis License.

  7. If, as a consequence of a court judgment or allegation of patentinfringement or for any other reason (not limited to patent issues),conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do notexcuse you from the conditions of this License.  If you cannotdistribute so as to satisfy simultaneously your obligations under thisLicense and any other pertinent obligations, then as a consequence youmay not distribute the Program at all.  For example, if a patentlicense would not permit royalty-free redistribution of the Program byall those who receive copies directly or indirectly through you, thenthe only way you could satisfy both it and this License would be torefrain entirely from distribution of the Program.

If any portion of this section is held invalid or unenforceable underany particular circumstance, the balance of the section is intended toapply and the section as a whole is intended to apply in other circumstances.

It is not the purpose of this section to induce you to infringe anypatents or other property right claims or to contest validity of anysuch claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which isimplemented by public license practices.  Many people have madegenerous contributions to the wide range of software distributedthrough that system in reliance on consistent application of thatsystem; it is up to the author/donor to decide if he or she is willingto distribute software through any other system and a licensee cannot impose that choice.

This section is intended to make thoroughly clear what is believed tobe a consequence of the rest of this License.

  8. If the distribution and/or use of the Program is restricted incertain countries either by patents or by copyrighted interfaces, theoriginal copyright holder who places the Program under this License may add an explicit geographical distribution limitation excludingthose countries, so that distribution is permitted only in or amongcountries not thus excluded.  In such case, this License incorporates the limitation as if written in the body of this License.

  9. The Free Software Foundation may publish revised and/or new versionsof the General Public License from time to time.  Such new versions willbe similar in spirit to the present version, but may differ in detail toaddress new problems or concerns.

Each version is given a distinguishing version number.  If the Programspecifies a version number of this License which applies to it and \"anylater version\", you have the option of following the terms and conditionseither of that version or of any later version published by the FreeSoftware Foundation.  If the Program does not specify a version number ofthis License, you may choose any version ever published by the Free SoftwareFoundation.

  10. If you wish to incorporate parts of the Program into other freeprograms whose distribution conditions are different, write to the authorto ask for permission.  For software which is copyrighted by the FreeSoftware Foundation, write to the Free Software Foundation; we sometimesmake exceptions for this.  Our decision will be guided by the two goalsof preserving the free status of all derivatives of our free software andof promoting the sharing and reuse of software generally.

		NO WARRANTY

  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTYFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHENOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIESPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSEDOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OFMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK ASTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THEPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,REPAIR OR CORRECTION.

  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITINGWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/ORREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISINGOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITEDTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BYYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHERPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THEPOSSIBILITY OF SUCH DAMAGES.

END OF TERMS AND CONDITIONS WRITTEN OFFER The source code for any program binaries or compressed scripts that areincluded with DesktopServer can be freely obtained by writing to:

   ServerPress, LLC
   Attn: DesktopServer Sourcecode
   931 N 33rd St
   Milwaukee WI, 53208",
	"description":"Please choose an option below and click the Continue button to proceed. ",
	"options": [
		{
			"name":"New DesktopServer Installation",
			"estimate":"120",
			"disable":["dir /AD c:\\","xampplite"],
			"finishMessage":"Installation is now complete. You can find DesktopServer in your c:\\xampplite folder. Thank you for using ServerPress.com's DesktopServer.",
			"abortedMessage":"The installer will now quit.",
			"commands":[
				["ifshell", "netstat -a | find \"LISTEN\"", ":80 "],
					["messagebox","It appears that you have another web server already running on port 80. DesktopServer cannot be installed. Check that you do not have Microsoft Internet Information Server or WAMP running. See 'troubleshooting' in our 'How to Install DeskopServer' guide via serverpress.com/downloads."],
					["abort"],
				["endshell"],
				["ifshell", "netstat -a | find \"LISTEN\"", ":443 "],
					["messagebox","It appears that you have another web server already running on port 443. DesktopServer cannot be installed. Check that you do not have Microsoft Internet Information Server or WAMP running. See 'troubleshooting' in our 'How to Install DeskopServer' guide via serverpress.com/downloads."],
					["abort"],
				["endshell"],
				["ifshell", "tasklist", "mysqld.exe"],
					["messagebox","It appears that you have a MySQL server running. DesktopServer already includes a MySQL server and cannot be installed. Running more than one MySQL server may corrupt data! Please turn off and remove your other server (i.e. MAMP, Bitnami, etc.). See 'troubleshooting' in our 'How to Install DeskopServer' guide via serverpress.com/downloads."],
					["abort"],
				["endshell"],
				["caption","Please wait while files are being copied..."],
				["shell", "mkdir \"c:\\xampplite\""],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\all\" c:\\xampplite\\all"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\apache\" c:\\xampplite\\apache"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\DesktopServer Libs\" \"c:\\xampplite\\DesktopServer Libs\""],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\Resources\" \"c:\\xampplite\\Resources\""],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\cgi-bin\" c:\\xampplite\\cgi-bin"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\contrib\" c:\\xampplite\\contrib"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\htdocs\" c:\\xampplite\\htdocs"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\install\" c:\\xampplite\\install"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\licenses\" c:\\xampplite\\licenses"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\locale\" c:\\xampplite\\locale"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\tmp\" c:\\xampplite\\tmp"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\webdav\" c:\\xampplite\\webdav"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\src\" c:\\xampplite\\src"],
				["caption","Installing additional libraries..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\Libs\" c:\\xampplite\\Libs"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\other\" c:\\xampplite\\other"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\php\" c:\\xampplite\\php"],
				["caption","Installing phpMyAdmin..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\phpMyAdmin\" c:\\xampplite\\phpMyAdmin"],				
				["caption","Installing MySQL..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\mysql\" c:\\xampplite\\mysql"],
				["shell", "c:& cd \\xampplite\\mysql&c:\\xampplite\\all\\bin\\unzip.exe -q -o backup.zip"],
				["caption","Installing plugins..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\ds-plugins\" c:\\xampplite\\ds-plugins"],
				["shell", "c:& cd \\xampplite\\ds-plugins&c:\\xampplite\\all\\bin\\unzip.exe -q -o ds-cli-win.zip"],
				["shell", "del /F /Q c:\\xampplite\\ds-plugins\\ds-cli-win.zip"],
				["caption","Installing WordPress files..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\blueprints\" c:\\xampplite\\blueprints"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\DesktopServer.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\Trace.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\quick-deploy.php\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\xampp_cli.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\DesktopServer.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\*.dll\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\Libs\\Shellx64.dll\" \"c:\\xampplite\\all\\DesktopServerHelper Libs\""],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcp120.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcp140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcr120.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\vccorlib140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\vcruntime140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\XojoGUIFramework64.dll\" c:\\xampplite\\all"],
				["caption","Optimizing runtime files."],
				["shell", "move c:\\xampplite\\all\\prefrepair.php c:\\xampplite\\ds-plugins\\ds-cli\\platform\\all\\prefrepair.php"],
				["shell", "move c:\\xampplite\\all\\bin\\prefrepair c:\\xampplite\\ds-plugins\\ds-cli\\platform\\all\\pre\\prefrepair"],
				["shell", "mv /Applications/XAMPP/xamppfiles/all/bin/prefrepair /Applications/XAMPP/ds-plugins/ds-cli/platform/mac/all/pre"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\etc"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\lib"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\bin"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\usr"],
				["shell", "\"[Installer]libs\\shell64\\shell64.exe\" \"[Installer]libs\\shell64\\ds-omit.cmd\""],
				["shell", "cd /D c:\\&c:\\xampplite\\other\\mkshortcut.exe \"/cygdrive/c/xampplite/DesktopServer.exe\" --desktop --name=\"DesktopServer\""],
				["caption","Installation complete."],
				["messagebox","Done! You can start DesktopServer from the C:\\xampplite\\DesktopServer.exe program icon. Click Finish to close the installer."]
			]
		},
		{
			"name":"Upgrade DesktopServer",
			"estimate":"120",
			"enable":["dir /AD c:\\","xampplite"],
			"default":["dir /AD c:\\","xampplite"],
			"finishMessage":"DesktopServer upgrade complete. You may now restart DesktopServer. Thank you for using ServerPress.com's DesktopServer.",
			"abortedMessage":"The installer will now quit.",
			"commands":[
				["caption","Please wait while we shut down services."],
				["shell", "taskkill /IM Trace.exe"],
				["shell", "taskkill /IM DesktopServer.exe"],
				["shell", "taskkill /IM DesktopServerHelper.exe"],
				["shell", "taskkill /IM httpd.exe"],
				["shell", "taskkill /IM mysqld.exe"],
				["shell", "taskkill /IM xampp-control.exe"],
				["shell", "taskkill /F /IM Trace.exe"],
				["shell", "taskkill /F /IM DesktopServer.exe"],
				["shell", "taskkill /F /IM httpd.exe"],
				["shell", "taskkill /F /IM xampp-control.exe"],
				["shell", "taskkill /F /IM bash.exe"],
				["shell","c:\\xampplite\\xampp_cli stop mysql", "10"],
				["shell", "c:\\xampplite\\xampp_cli stop xampp"],
				["shell", "c:\\xampplite\\mysql\\bin\\mysqladmin --user=root --password= shutdown", "10"],
				["caption", "Removing old ds-plugins..."],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\admin-color-bar"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\airplane-mode-0.0.8"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\airplane-mode-0.0.7"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\airplane-mode"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\bypass-login"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\clean-import"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\database-archive"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\databasecollationfix"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\debug-trace"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\ds-cli"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\ds-tools"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\ds-deploy"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\dreamweaver-support"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\local-admin-color-bar"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\local-ssl"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\mailbox-viewer"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\ngrok-integration"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins\\windows-compatibility-fix"],
				["caption","Updating plugins..."],
				["shell", "rmdir /S /Q c:\\xampplite\\all"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\all\" c:\\xampplite\\all"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\ds-plugins\" c:\\xampplite\\ds-plugins"],
				["shell", "c:& cd \\xampplite\\ds-plugins&c:\\xampplite\\all\\bin\\unzip.exe -q -o ds-cli-win.zip"],
				["shell", "del /F /Q c:\\xampplite\\ds-plugins\\ds-cli-win.zip"],
				["caption", "Backing up MySQL data..."],
				["shell", "xcopy /ceiqy c:\\xampplite\\mysql\\data \"c:\\xampplite\\data-sav-%date:/=-% %time::=-%\""],
				["caption", "Backing up htdocs data..."],
				["shell", "xcopy /ceiqy c:\\xampplite\\htdocs \"c:\\xampplite\\htdocs-sav-%date:/=-% %time::=-%\""],
				["shell", "\"[Installer]libs\\upgrade\\pre-upgrade.bat\""],
				["caption","Removing old core files..."],
				["shell", "rmdir /S /Q c:\\xampplite\\apache"],
				["shell", "rmdir /S /Q c:\\xampplite\\cgi-bin"],
				["shell", "rmdir /S /Q c:\\xampplite\\contrib"],
				["shell", "rmdir /S /Q \"c:\\xampplite\\DesktopServer Libs\""],
				["shell", "rmdir /S /Q \"c:\\xampplite\\DesktopServer Resources\""],
				["shell", "rmdir /S /Q c:\\xampplite\\htdocs"],
				["shell", "rmdir /S /Q c:\\xampplite\\install"],
				["shell", "rmdir /S /Q c:\\xampplite\\Libs"],
				["shell", "rmdir /S /Q c:\\xampplite\\licenses"],
				["shell", "rmdir /S /Q c:\\xampplite\\locale"],
				["shell", "rmdir /S /Q c:\\xampplite\\mysql"],
				["shell", "rmdir /S /Q c:\\xampplite\\other"],
				["shell", "rmdir /S /Q c:\\xampplite\\perl"],
				["shell", "rmdir /S /Q c:\\xampplite\\php"],
				["shell", "rmdir /S /Q c:\\xampplite\\phpMyAdmin"],
				["shell", "rmdir /S /Q c:\\xampplite\\Resources"],
				["shell", "rmdir /S /Q c:\\xampplite\\security"],
				["shell", "rmdir /S /Q c:\\xampplite\\sendmail"],
				["shell", "rmdir /S /Q c:\\xampplite\\mailoutput"],
				["shell", "rmdir /S /Q c:\\xampplite\\mailtodisk"],
				["shell", "rmdir /S /Q c:\\xampplite\\webalizer"],
				["shell", "rmdir /S /Q c:\\xampplite\\webdav"],
				["shell", "rmdir /S /Q \"[StartMenu]DesktopServer\""],
				["shell", "del /F /Q c:\\xampplite\\quick-deploy.php"],
				["shell", "del /F /Q c:\\xampplite\\Trace.exe"],
				["shell", "del /F /Q c:\\xampplite\\DesktopServer.exe"],
				["shell", "del /F /Q c:\\xampplite\\xampp_cli.exe"],
				["shell", "del /F /Q c:\\xampplite\\ucrtbase.dll"],
				["shell", "del /F /Q c:\\xampplite\\api-ms*.dll"],
				["caption", "Installing new core files..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\apache\" c:\\xampplite\\apache"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\Resources\" \"c:\\xampplite\\Resources\""],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\cgi-bin\" c:\\xampplite\\cgi-bin"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\contrib\" c:\\xampplite\\contrib"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\htdocs\" c:\\xampplite\\htdocs"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\install\" c:\\xampplite\\install"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\licenses\" c:\\xampplite\\licenses"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\locale\" c:\\xampplite\\locale"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\tmp\" c:\\xampplite\\tmp"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\webdav\" c:\\xampplite\\webdav"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\src\" c:\\xampplite\\src"],
				["caption","Updating additional libraries..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\Libs\" c:\\xampplite\\Libs"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\other\" c:\\xampplite\\other"],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\php\" c:\\xampplite\\php"],
				["caption","Updating phpMyAdmin..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\phpMyAdmin\" c:\\xampplite\\phpMyAdmin"],				
				["caption","Updating MySQL..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\mysql\" c:\\xampplite\\mysql"],
				["shell", "c:& cd \\xampplite\\mysql&c:\\xampplite\\all\\bin\\unzip.exe -q -o backup.zip"],
				["caption","Updating WordPress files..."],
				["shell", "xcopy /ceiqy \"[Installer]libs\\xampplite\\blueprints\" c:\\xampplite\\blueprints"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\DesktopServer.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\Trace.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\quick-deploy.php\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\xampp_cli.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\DesktopServer.exe\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\*.dll\" c:\\xampplite"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\Libs\\Shellx64.dll\" \"c:\\xampplite\\all\\DesktopServerHelper Libs\""],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcp120.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcp140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\msvcr120.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\vccorlib140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\vcruntime140.dll\" c:\\xampplite\\all"],
				["shell", "copy /Y \"[Installer]libs\\xampplite\\XojoGUIFramework64.dll\" c:\\xampplite\\all"],
				["caption","Optimizing runtime files."],
				["shell", "\"[Installer]libs\\shell64\\shell64.exe\" \"[Installer]libs\\shell64\\ds-omit.cmd\""],
				["caption", "Updating MySQL data..."],
				["shell", "move c:\\xampplite\\all\\prefrepair.php c:\\xampplite\\ds-plugins\\ds-cli\\platform\\all"],
				["shell", "move c:\\xampplite\\all\\bin\\prefrepair c:\\xampplite\\ds-plugins\\ds-cli\\platform\\all\\pre"],
				["shell", "[Installer]/libs/upgrade/post-upgrade.bat"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\etc"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\lib"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\bin"],
				["shell", "c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\symfix\\symfix.exe c:\\xampplite\\ds-plugins\\ds-cli\\platform\\win32\\cygwin\\usr"],
				["shell", "cd /D c:\\&c:\\xampplite\\other\\mkshortcut.exe \"/cygdrive/c/xampplite/DesktopServer.exe\" --desktop --name=\"DesktopServer\""],
				["messagebox", "For compatibility, the new default folder is simply 'Sites' in your user folder. Any old sites in the 'Documents/Websites' folder have been moved to the 'Sites' folder."],
				["caption","Upgrade complete."],
				["messagebox","Upgrade complete. You can start DesktopServer from the C:\\xampplite\\DesktopServer.exe program icon. Click Finish to close the installer."]
			]
		},
		{
			"name":"Uninstall (CAUTION: Deletes Database)",
			"estimate":"120",
			"enable":["dir /AD c:\\","xampplite"],
			"finishMessage":"DesktopServer has now been removed. Thank you for using ServerPress.com's DesktopServer.",
			"abortedMessage":"The installer will now quit.",
			"commands":[
				["caption","Please wait while we remove services."],
				["shell", "c:\\xampplite\\xampp_cli stop xampp"],
				["caption", "Stopping services..."],
				["shell", "taskkill /IM Trace.exe"],
				["shell", "taskkill /IM DesktopServer.exe"],
				["shell", "taskkill /IM DesktopServerHelper.exe"],
				["shell", "taskkill /IM httpd.exe"],
				["shell", "taskkill /IM mysqld.exe"],
				["shell", "taskkill /IM xampp-control.exe"],
				["shell", "taskkill /F /IM Trace.exe"],
				["shell", "taskkill /F /IM DesktopServer.exe"],
				["shell", "taskkill /F /IM httpd.exe"],
				["shell", "taskkill /F /IM mysqld.exe"],
				["shell", "taskkill /F /IM xampp-control.exe"],
				["shell", "taskkill /F /IM bash.exe"],
				["caption","Please wait while files are being removed..."],
				["shell", "rmdir /S /Q c:\\xampplite\\anonymous"],
				["shell", "rmdir /S /Q c:\\xampplite\\all"],
				["shell", "rmdir /S /Q c:\\xampplite\\apache"],
				["shell", "rmdir /S /Q c:\\xampplite\\ds-plugins"],
				["shell", "rmdir /S /Q c:\\xampplite\\src"],
				["caption","Removing Apache libraries..."],
				["shell", "rmdir /S /Q c:\\xampplite\\cgi-bin"],
				["shell", "rmdir /S /Q c:\\xampplite\\htdocs"],
				["shell", "rmdir /S /Q c:\\xampplite\\Libs"],
				["shell", "rmdir /S /Q c:\\xampplite\\php"],
				["caption","Removing phpMyAdmin..."],
				["shell", "rmdir /S /Q c:\\xampplite\\phpMyAdmin"],
				["shell", "rmdir /S /Q c:\\xampplite\\licenses"],
				["shell", "rmdir /S /Q c:\\xampplite\\webalizer"],
				["shell", "rmdir /S /Q c:\\xampplite\\webdav"],
				["caption","Removing MySQL..."],
				["shell", "rmdir /S /Q c:\\xampplite\\install"],
				["shell", "rmdir /S /Q c:\\xampplite\\mysql"],
				["shell", "rmdir /S /Q c:\\xampplite\\tmp"],
				["caption","Cleaning up preferences..."],
				["shell", "rmdir /S /Q \"c:\\Documents and Settings\\All Users\\Application Data\\DesktopServer\""],
				["shell", "rmdir /S /Q c:\\ProgramData\\DesktopServer"],
				["shell", "rmdir /S /Q c:\\ProgramData\\.desktopserver"],
				["shell", "rmdir /S /Q \"[StartMenu]DesktopServer\""],
				["shell", "rmdir /S /Q c:\\xampplite\\blueprints"],
				["shell", "rmdir /S /Q c:\\xampplite"],
				["shell", "del %USERPROFILE%\\Desktop\\DesktopServer.lnk"],
				["caption","Uninstall complete."],
				["messagebox","Click Finish to close the installer."]
			]
		}
	]
}
